<!-- dflook/terraform-github-actions {"workspace":"default","backend":"2177ade95b614005d6129cb1d43d84bbbdf2740830d98576de935a97850a3c08","backend_type":"s3","plan_job_ref":"Job Terraform CI #7 at https://github.com/dannylongeuay/cluster-management/actions/runs/3125028272","plan_hash":"9053541d6e7cc39d31710bf157035dbf7fb921992056e22094f495f5938e7e04","plan_text_format":"text"} -->
Terraform plan in __terraform/ndsquared-prod-sfo3__
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_certificate.ndsq_domain_cert must be replaced
-/+ resource "digitalocean_certificate" "ndsq_domain_cert" {
      ~ domains          = [ # forces replacement
          + "*.ndsquared.net",
            # (1 unchanged element hidden)
        ]
      ~ id               = "****************" -> (known after apply)
        name             = "ndsq-domain-cert"
      ~ not_after        = "2022-12-20T03:36:24Z" -> (known after apply)
      ~ sha1_fingerprint = "a0f8149be9be40052eb2744cdd1d204fac71f83d" -> (known after apply)
      ~ state            = "verified" -> (known after apply)
      ~ uuid             = "3c7379c8-15ed-44f5-8b0a-c3b0834fa627" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform CI #7](https://github.com/dannylongeuay/cluster-management/actions/runs/3125028272)